# Выведите на экран координаты вектора.

import numpy as np

print(np.array([-9, -3]))
