import numpy as np
import scipy.stats as stats

X = [2637.9404186, 3123.31101043, 4579.52788905, 3552.24308212,
     1979.72074512, 4062.15861921, 2925.53339485, 6009.41452041,
     3118.69061871, 3862.68743002]
Y = [22.67476352, 44.74310987, 64.55990754, 123.34774546,
     140.64466074, 13.8039958, 41.22101815, 110.36824261,
     153.93959758, 31.83783785]

pvalue = 0  # переменная для сохранения p-value

# Ваш код тут
LogX = np.log(X)
LogY = np.log(Y)

ttest_ind = stats.ttest_ind(a=LogX, b=LogY, equal_var=True)
# print(ttest_ind)

pvalue = ttest_ind[1]

if pvalue < 0.05:
    print("Выборки обладают различными средними")
else:
    print("Выборки могут обладать одинаковыми средними")
