import numpy as np
from sklearn.linear_model import LinearRegression, Ridge
from sklearn.metrics import mean_squared_error

X = np.array([[-23.44945014],
              [-22.34621915],
              [-24.14482999],
              [-23.85915898],
              [-21.66191969],
              [-22.88829944],
              [-21.71693324],
              [-23.80343122],
              [-23.58869713],
              [-22.38402447],
              [-22.97945586],
              [-21.49927261],
              [-23.04685831],
              [-22.0785003],
              [-25.06670151],
              [-22.62561044],
              [-24.10412229],
              [-23.56941379],
              [-21.12769674],
              [-23.58437672]])
y = np.array([24.31774032, 45.75263605, 1.01943242, -3.96883211,
              79.54556652, 19.92541317, 70.52854494, 2.09212642,
              47.73289137, 38.95078506, 56.7826853, 100.02550457,
              45.4939922, 40.05036673, -18.29486097, 27.09023009,
              -1.58389684, 6.66794732, 92.16220381, 40.18403743])

X_test = np.array([[-21.45343859],
                   [-22.78254428],
                   [-20.74927166],
                   [-22.00704445],
                   [-24.93543409],
                   [-20.61276235],
                   [-22.02519753],
                   [-24.88588157],
                   [-24.3675808],
                   [-23.04600232]])

y_test = np.array([39.88017176, 46.20680524, 38.09567885, 80.31288399, 23.13226831,
                   68.60292796, 27.7007218, -5.65757616, 24.27408906, 2.71539397])

model = Ridge(alpha=29)

model.fit(X, y)

model_predict = model.predict(X)  # вектор коэффициентов
print(model_predict)
squared_error = mean_squared_error(model_predict, y)
print(squared_error)

predict_test = model.predict(X_test)
print(predict_test)
error_test = mean_squared_error(predict_test, y_test)
print(error_test)
print(model.alpha)
